---
kind: method
id: M:Autodesk.Revit.DB.Analysis.EnergyDataSettings.CheckRangeOfPercentageSkylights(System.Double)
source: html/99df2c0a-bdf5-f187-b1a6-5d34533d58de.htm
---
# Autodesk.Revit.DB.Analysis.EnergyDataSettings.CheckRangeOfPercentageSkylights Method

Checks that the percentage skylights value is between 0.00 and 0.95.

## Syntax (C#)
```csharp
public static bool CheckRangeOfPercentageSkylights(
	double percentageSkylights
)
```

## Parameters
- **percentageSkylights** (`System.Double`) - The percentage skylights to be checked.

## Returns
True if the percentage skylights value is between 0.00 and 0.95, false otherwise.